Revit 2026 API

# UIDocumentGetOpenUIViews Method

---

Get a list of all open view windows in the Revit user interface.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<UIView> GetOpenUIViews()
```
```vb
Public Function GetOpenUIViews As IList(Of UIView)
```
```cpp
public:
IList<UIView^>^ GetOpenUIViews()
```
```fsharp
member GetOpenUIViews : unit -> IList<UIView>
```

#### Return Value

IListUIView

A sheet view with an activated viewport will return the view associated with the activated viewport, not the sheet view.

#### Reference

UIDocument Class

Autodesk.Revit.UI Namespace